# GetCustomHandleName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IRebarUpdateServer..::..GetCustomHandleName Method
IRebarUpdateServer Interface See Also
---
This function should return the name of the handle.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
bool GetCustomHandleName(
	RebarHandleNameData handleNameData
)
```

Visual Basic
---
```text
Function GetCustomHandleName ( _
	handleNameData As RebarHandleNameData _
) As Boolean
```

Visual C++
---
```text
bool GetCustomHandleName(
	RebarHandleNameData^ handleNameData
)
```

# ### Parameters
handleNameData
    Type: Autodesk.Revit.DB.Structure..::..RebarHandleNameData The class used to output the rebarHandle name.
# ### Return Value
Returns true if the handle name is defined successfully, false otherwise.
# Remarks
This function is called during edit constraints command when the mouse is over a handle or the funtion RebarConstrainedHandle.GetCustomHandleName() is called.
# See Also
IRebarUpdateServer Interface
Autodesk.Revit.DB.Structure Namespace